# [01]

In [1]:
import pandas as pd
import easygui

인원리스트 = [[i,i+1,i+2,i+3] for i in range(1,18,4)]

In [2]:
인원리스트

[[1, 2, 3, 4],
 [5, 6, 7, 8],
 [9, 10, 11, 12],
 [13, 14, 15, 16],
 [17, 18, 19, 20]]

In [3]:
시프레임 = pd.DataFrame(인원리스트, columns=['최', '박', '이', '김'],
                   index=['수원', '화성', '용인', '청주', '충주'])

In [4]:
시프레임

     최   박   이   김
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  16
충주  17  18  19  20

In [6]:
시프레임.sum().to_frame('city')

   city
최    45
박    50
이    55
김    60

In [8]:
시프레임.sum(axis=1).to_frame('총인원')

    총인원
수원   10
화성   26
용인   42
청주   58
충주   74

In [10]:
filename1 = easygui.fileopenbox()

In [11]:
filename1

'C:\\Users\\hana1602a\\Documents\\excel_python\\엑셀과코딩사이.xlsx'

In [12]:
workbook1 = pd.ExcelFile(filename1)
df0 = workbook1.parse(sheetname=0)

In [13]:
df0

    시   최   박   이   김
0  수원   1   2   3   4
1  화성   5   6   7   8
2  용인   9  10  11  12
3  청주  13  14  15  17
4  충주  18  19  20  21

In [15]:
df0 = df0.set_index('시')

In [16]:
df0

     최   박   이   김
시
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  17
충주  18  19  20  21

# [02]

In [1]:
import pandas as pd

In [2]:
filename1 = '~\\documents\\excel_python\\엑셀과코딩사이.xlsx'

In [3]:
filename1

'~\\documents\\excel_python\\엑셀과코딩사이.xlsx'

In [4]:
workbook1 = pd.ExcelFile(filename1)

In [17]:
df0 = workbook1.parse(sheetname=0, index_col = 0)

In [18]:
df0

     최   박   이   김
시
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  16
충주  17  18  19  20
천안  21  22  23  24

In [20]:
df0.values.tolist()

[[1, 2, 3, 4],
 [5, 6, 7, 8],
 [9, 10, 11, 12],
 [13, 14, 15, 16],
 [17, 18, 19, 20],
 [21, 22, 23, 24]]

In [21]:
[list(range(i,i+4)) for i in range(1,22,4)]

[[1, 2, 3, 4],
 [5, 6, 7, 8],
 [9, 10, 11, 12],
 [13, 14, 15, 16],
 [17, 18, 19, 20],
 [21, 22, 23, 24]]

In [23]:
df0.columns.tolist()

['최', '박', '이', '김']

In [25]:
df0.index.tolist()

['수원', '화성', '용인', '청주', '충주', '천안']

In [28]:
df0

     최   박   이   김
시
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  16
충주  17  18  19  20
천안  21  22  23  24

In [30]:
df0.sum().to_frame()

    0
최  66
박  72
이  78
김  84

In [32]:
df0.sum(axis=1).to_frame()

     0
시
수원  10
화성  26
용인  42
청주  58
충주  74
천안  90

In [33]:
df1 = workbook1.parse(sheetname=1, index_col=0)

In [34]:
df1

     도
시
수원  경기
화성  경기
용인  경기
청주  충북
충주  충북
천안  충남

In [36]:
df01=df0.join(df1)

In [37]:
df01

     최   박   이   김   도
시
수원   1   2   3   4  경기
화성   5   6   7   8  경기
용인   9  10  11  12  경기
청주  13  14  15  16  충북
충주  17  18  19  20  충북
천안  21  22  23  24  충남

In [40]:
df01=df01.reset_index().set_index(['도','시'])

In [41]:
df01

        최   박   이   김
도  시
경기 수원   1   2   3   4
   화성   5   6   7   8
   용인   9  10  11  12
충북 청주  13  14  15  16
   충주  17  18  19  20
충남 천안  21  22  23  24

# [03]

In [3]:
import pandas as pd
filename1 = '~\\documents\\excel_python\\엑셀과코딩사이.xlsx'
workbook1 = pd.ExcelFile(filename1)
df0 = workbook1.parse(sheetname=0, index_col=0)
df1 = workbook1.parse(sheetname=1, index_col=0)
df01 = df0.join(df1)
df01=df01.reset_index().set_index(['도','시'])

In [4]:
df01

        최   박   이   김
도  시
경기 수원   1   2   3   4
   화성   5   6   7   8
   용인   9  10  11  12
충북 청주  13  14  15  16
   충주  17  18  19  20
충남 천안  21  22  23  24